# Database Name - People, Data inside people

In [276]:
people = {
    "first" : ["Indranil","Mayan","Anubhav"],
    "last" : ["Palit","Sahoo","Srivastva"],
    "email" : ["123@email.com","234@email.com","456@email.com"]
}

In [277]:
people['email']

['123@email.com', '234@email.com', '456@email.com']

In [278]:
import pandas as pd

In [279]:
df = pd.DataFrame(people) #Importing the data into the dataframe

In [280]:
df #printing the dataframe

      first       last          email
0  Indranil      Palit  123@email.com
1     Mayan      Sahoo  234@email.com
2   Anubhav  Srivastva  456@email.com

In [281]:
df['email'] #finding the dataframe for the email column

0    123@email.com
1    234@email.com
2    456@email.com
Name: email, dtype: object

In [282]:
type(df['email'])

pandas.core.series.Series

In [283]:
df[['email','last']] #To print two columns at once you have to print the dataframe together

           email       last
0  123@email.com      Palit
1  234@email.com      Sahoo
2  456@email.com  Srivastva

In [284]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

##### Using iLoc and Loc(iLoc is index Column find that is find index like 0 and 1 but Loc is basically saying find the index via column name or row name but you can also use 0 and 1)

#### Dont use the first data for the above line use the below data to analyse if you want to analyse two data at once

In [285]:
first_data = df.iloc[0]
last_data = df.iloc[1]
print([[first_data, last_data]])

[[first         Indranil
last             Palit
email    123@email.com
Name: 0, dtype: object, first            Mayan
last             Sahoo
email    234@email.com
Name: 1, dtype: object]]

In [286]:
df.iloc[[0,1],2] #the 0 and 1 represents rows so 0th row and 1st row and the 2 later represents columns that is 2nd column 
# that is why you are seeing only the emails being printed

0    123@email.com
1    234@email.com
Name: email, dtype: object

In [287]:
df.loc[[0,1],['email','last']] # now I have put the 0 and 1 in a list that is compelling the loc to print the rows 0 and 1 apart from 
#that we need to specify the name of the column for which we want the data to be presented

# in here you also see that if you want two columns at once then print them in a list

           email   last
0  123@email.com  Palit
1  234@email.com  Sahoo

In [288]:
df['email']

0    123@email.com
1    234@email.com
2    456@email.com
Name: email, dtype: object

In [289]:
df.set_index('email', inplace=True)

In [290]:
df

                  first       last
email
123@email.com  Indranil      Palit
234@email.com     Mayan      Sahoo
456@email.com   Anubhav  Srivastva

In [291]:
df.index #the reason it shows index as email is because we have set index as email in the previous cell that means by default 
#the default index is email

Index(['123@email.com', '234@email.com', '456@email.com'], dtype='object', name='email')

## Video No -05

In [292]:
df.reset_index(inplace=True)

In [293]:
df

           email     first       last
0  123@email.com  Indranil      Palit
1  234@email.com     Mayan      Sahoo
2  456@email.com   Anubhav  Srivastva

In [294]:
df.loc[1,['first','last']] = ['Mayan','Sahoo']

In [295]:
df.loc[2,['first','last']] = ['Anubhav','Srivastva']

In [296]:
df

           email     first       last
0  123@email.com  Indranil      Palit
1  234@email.com     Mayan      Sahoo
2  456@email.com   Anubhav  Srivastva

In [297]:
df['email'].str.upper()

0    123@EMAIL.COM
1    234@EMAIL.COM
2    456@EMAIL.COM
Name: email, dtype: object

In [298]:
#apply   #map # replace #applymap

In [299]:
df['email'].apply(len)

0    13
1    13
2    13
Name: email, dtype: int64

In [300]:
def updateemail(email):
    return email.upper()

In [301]:
df['email'].apply(updateemail)

0    123@EMAIL.COM
1    234@EMAIL.COM
2    456@EMAIL.COM
Name: email, dtype: object

In [302]:
#to change in the actual table

In [303]:
df['email'] = df['email'].apply(updateemail)

In [304]:
df

           email     first       last
0  123@EMAIL.COM  Indranil      Palit
1  234@EMAIL.COM     Mayan      Sahoo
2  456@EMAIL.COM   Anubhav  Srivastva

In [305]:
#using lambdas

In [306]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [307]:
df

           email     first       last
0  123@email.com  Indranil      Palit
1  234@email.com     Mayan      Sahoo
2  456@email.com   Anubhav  Srivastva

In [308]:
df.apply(len)

email    3
first    3
last     3
dtype: int64

In [309]:
len(df['email'])

3

In [310]:
df.apply(pd.Series.min)

email    123@email.com
first          Anubhav
last             Palit
dtype: object

In [311]:
df

           email     first       last
0  123@email.com  Indranil      Palit
1  234@email.com     Mayan      Sahoo
2  456@email.com   Anubhav  Srivastva

In [312]:
df.loc[0]

email    123@email.com
first         Indranil
last             Palit
Name: 0, dtype: object

In [313]:
df.applymap(len)

   email  first  last
0     13      8     5
1     13      5     5
2     13      7     9

In [314]:
df.applymap(str.lower)

           email     first       last
0  123@email.com  indranil      palit
1  234@email.com     mayan      sahoo
2  456@email.com   anubhav  srivastva

# Video No -06 - Add/Remove Rows

In [315]:
df['first']+ ' ' +df['last']

0       Indranil Palit
1          Mayan Sahoo
2    Anubhav Srivastva
dtype: object

In [316]:
#to create a new column you have to do
df['full_name'] = df['first'] + ' ' +df['last']

In [317]:
df

           email     first       last          full_name
0  123@email.com  Indranil      Palit     Indranil Palit
1  234@email.com     Mayan      Sahoo        Mayan Sahoo
2  456@email.com   Anubhav  Srivastva  Anubhav Srivastva

In [318]:
df.drop(columns=['first','last'],inplace=True)

In [319]:
df

           email          full_name
0  123@email.com     Indranil Palit
1  234@email.com        Mayan Sahoo
2  456@email.com  Anubhav Srivastva

In [322]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [323]:
df

           email          full_name     first       last
0  123@email.com     Indranil Palit  Indranil      Palit
1  234@email.com        Mayan Sahoo     Mayan      Sahoo
2  456@email.com  Anubhav Srivastva   Anubhav  Srivastva

In [327]:
df.append({'first':'Tony'},ignore_index=True)

C:\Users\indro\AppData\Local\Temp\ipykernel_9716\3339547171.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Tony'},ignore_index=True)

           email          full_name     first       last
0  123@email.com     Indranil Palit  Indranil      Palit
1  234@email.com        Mayan Sahoo     Mayan      Sahoo
2  456@email.com  Anubhav Srivastva   Anubhav  Srivastva
3            NaN                NaN      Tony        NaN

In [348]:
people = {
    'first': ['Tony','Steve'],
    'last': ['Stark','Rogers'],
    'email': ['IronMan@avenge.com','Cap@avenge.com']
}

df2 = pd.DataFrame(people)

In [333]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [345]:
df.append(df2,ignore_index=True,sort=False)

C:\Users\indro\AppData\Local\Temp\ipykernel_9716\1395412685.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2,ignore_index=True,sort=False)

                email          full_name     first       last
0       123@email.com     Indranil Palit  Indranil      Palit
1       234@email.com        Mayan Sahoo     Mayan      Sahoo
2       456@email.com  Anubhav Srivastva   Anubhav  Srivastva
3  IronMan@avenge.com                NaN      Tony      Stark
4      Cap@avenge.com                NaN     Steve     Rogers

In [352]:
df.sort_values(by=['last','first'],ascending=[False,True])

           email          full_name     first       last
2  456@email.com  Anubhav Srivastva   Anubhav  Srivastva
1  234@email.com        Mayan Sahoo     Mayan      Sahoo
0  123@email.com     Indranil Palit  Indranil      Palit

In [354]:
df['last'].sort_values()

0        Palit
1        Sahoo
2    Srivastva
Name: last, dtype: object

# Cleaning Data and Casting

In [1]:
import numpy as np
import pandas as pd